/*НОД
Составить функцию, которая определяет наибольший общий делитель двух натуральных и привести пример ее использования.
int nod(int a, int b)
Формат входных данных
Два целых положительных числа
Формат результата
Одно целое число - наибольший общий делитель.
Примеры
Входные данные
14 21
Результат работы
7 */

#include <math.h>
#include <stdio.h>
#include <stdint.h>
//#include <locale.h>



float sinn(float x)
{
   float b, c, d;

        for (int i=3; i<=a; i=i+2)
        {
            c*=i;

        }
    return x;
}

int a, b;

int main(void)
{
    scanf("%d%d", &a, &b);
    printf ("%d", nod(a,b));
    return 0;
}
