/* Наименьшая и наибольшая цифра
Организовать ввод натурального числа с клавиатуры. Программа должна определить наименьшую и наибольшую цифры, которые входят в состав данного натурального числа.
Формат входных данных
Целое неотрицательное число
Формат результата
Две цифры через пробел. Сначала наименьшая цифра числа, затем наибольшая.
Примеры
Входные данные
15
Результат работы
1 5
Входные данные
2457
Результат работы
2 7
Входные данные
22
Результат работы
2 2 */

#include <stdio.h>
#include <math.h>
//#include <locale.h>

int main(void)
{
    int a, min, max;
    scanf ("%d", &a);
	max=a%10;
	min=a%10;
	
    for (; ((a%10)|(a/10)) != 0;)
    {
		max = a%10 > max ? a%10 : max;
        min = a%10 < min ? a%10 : min;
        a/=10;
    }

    printf ("%d %d", min, max);


    return 0;
}
